# loading, reading, cleaning data from CSVs

In [33]:
import pandas as pd
from sqlalchemy import create_engine

# READING & CLEANING donnees_elec_adresse

In [34]:
# electricity data 2018/2019
addresse_2018 = './data/elec/donnees_elec_adresse_2018.csv'
addresse_2019 = './data/elec/donnees_elec_adresse_2019.csv'

In [35]:
#reading CSV
addresse_2018 = pd.read_csv(addresse_2018, sep=';')
addresse_2018.head(2)
addresse_2018.columns

Index(['OPERATEUR', 'ANNEE', 'FILIERE', 'CODE_IRIS', 'ADRESSE', 'NOM_COMMUNE',
       'CODE_GRAND_SECTEUR', 'CONSO', 'PDL'],
      dtype='object')

In [36]:
#reading CSV
addresse_2019 = pd.read_csv(addresse_2019, sep=';')
addresse_2019.head(2)
addresse_2019. columns

Index(['OPERATEUR', 'ANNEE', 'FILIERE', 'CODE_IRIS', 'NOM_COMMUNE', 'ADRESSE',
       'CODE_GRAND_SECTEUR', 'CONSO', 'PDL'],
      dtype='object')

In [37]:
#setting columns in order 

addresse_2019  = addresse_2019[['OPERATEUR', 'ANNEE', 'FILIERE', 'CODE_IRIS','ADRESSE', 'NOM_COMMUNE',
       'CODE_GRAND_SECTEUR', 'CONSO', 'PDL']]
#Double check 
addresse_2019.columns

Index(['OPERATEUR', 'ANNEE', 'FILIERE', 'CODE_IRIS', 'ADRESSE', 'NOM_COMMUNE',
       'CODE_GRAND_SECTEUR', 'CONSO', 'PDL'],
      dtype='object')

In [38]:
#concatenate with pd
elec_adresse = [addresse_2018, addresse_2019]
result_elec = pd.concat(elec_adresse).drop_duplicates()
result_elec.head(2)

,OPERATEUR,ANNEE,FILIERE,CODE_IRIS,ADRESSE,NOM_COMMUNE,CODE_GRAND_SECTEUR,CONSO,PDL
0,Enedis,2018,E,010040101,659 AVENUE LEON BLUM,AMBÉRIEU-EN-BUGEY,I,"852,40377",1
1,Enedis,2018,E,010040101,645 AVENUE LEON BLUM,AMBÉRIEU-EN-BUGEY,I,"61,78001",1

In [39]:
result_elec2 = result_elec[['NOM_COMMUNE','CODE_IRIS']].drop_duplicates()
result_elec2.head(2)

          NOM_COMMUNE  CODE_IRIS
0   AMBÉRIEU-EN-BUGEY  010040101
28  AMBÉRIEU-EN-BUGEY  010040102

In [40]:
result_elec.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1132768 entries, 0 to 573808
Data columns (total 9 columns):
 #   Column              Non-Null Count    Dtype
---  ------              --------------    -----
 0   OPERATEUR           1132768 non-null  object
 1   ANNEE               1132768 non-null  int64
 2   FILIERE             1132768 non-null  object
 3   CODE_IRIS           1132768 non-null  object
 4   ADRESSE             1132524 non-null  object
 5   NOM_COMMUNE         1132767 non-null  object
 6   CODE_GRAND_SECTEUR  1132768 non-null  object
 7   CONSO               1132768 non-null  object
 8   PDL                 1132768 non-null  int64
dtypes: int64(2), object(7)
memory usage: 86.4+ MB

In [41]:
# READING & CLEANING donnees_gaz_adresse

In [42]:
import pandas as pd
from sqlalchemy import create_engine

# gas data 2018/2019
gas_2018 = './data/gaz/donnees_gaz_adresse_2018.csv'
gas_2019 = './data/gaz/donnees_gaz_adresse_2018.csv'

In [43]:
#reading CSV
gas_2018 = pd.read_csv(gas_2018, sep=';')
gas_2018.head(2)
gas_2018.columns

Index(['OPERATEUR', 'ANNEE', 'FILIERE', 'CODE_IRIS', 'ADRESSE', 'NOM_COMMUNE',
       'CODE_GRAND_SECTEUR', 'CONSO', 'PDL'],
      dtype='object')

In [44]:
#reading CSV
gas_2019 = pd.read_csv(gas_2019, sep=';')
gas_2019.head(2)
gas_2019.columns

Index(['OPERATEUR', 'ANNEE', 'FILIERE', 'CODE_IRIS', 'ADRESSE', 'NOM_COMMUNE',
       'CODE_GRAND_SECTEUR', 'CONSO', 'PDL'],
      dtype='object')

In [45]:
#concatenate with pd
gas_adresse = [gas_2018, gas_2019]
result_gas = pd.concat(gas_adresse)
result_gas.head()

,OPERATEUR,ANNEE,FILIERE,CODE_IRIS,ADRESSE,NOM_COMMUNE,CODE_GRAND_SECTEUR,CONSO,PDL
0,GRDF,2018,G,010040101,58 AVENUE PAUL PAINLEVE,AMBÉRIEU-EN-BUGEY,T,"4,641144e+02",1
1,GRDF,2018,G,010040101,54 AVENUE PAUL PAINLEVE,AMBÉRIEU-EN-BUGEY,R,"1,595118e+02",11
2,GRDF,2018,G,010040101,RTE CHATEAU GAILLARD,AMBÉRIEU-EN-BUGEY,T,"5,609286e+02",1
3,GRDF,2018,G,010040101,36 ALLEE DE LA BARBOTIERE,AMBÉRIEU-EN-BUGEY,T,"1,236034e+03",1
4,GRDF,2018,G,010040101,RUE MARIUS BERLIET,AMBÉRIEU-EN-BUGEY,T,"9,765200e+01",1

In [46]:
result_gas.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 477652 entries, 0 to 238825
Data columns (total 9 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   OPERATEUR           477652 non-null  object
 1   ANNEE               477652 non-null  int64
 2   FILIERE             477652 non-null  object
 3   CODE_IRIS           477652 non-null  object
 4   ADRESSE             477182 non-null  object
 5   NOM_COMMUNE         477652 non-null  object
 6   CODE_GRAND_SECTEUR  477652 non-null  object
 7   CONSO               477652 non-null  object
 8   PDL                 477652 non-null  int64
dtypes: int64(2), object(7)
memory usage: 36.4+ MB

In [47]:
result_elec.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1132768 entries, 0 to 573808
Data columns (total 9 columns):
 #   Column              Non-Null Count    Dtype
---  ------              --------------    -----
 0   OPERATEUR           1132768 non-null  object
 1   ANNEE               1132768 non-null  int64
 2   FILIERE             1132768 non-null  object
 3   CODE_IRIS           1132768 non-null  object
 4   ADRESSE             1132524 non-null  object
 5   NOM_COMMUNE         1132767 non-null  object
 6   CODE_GRAND_SECTEUR  1132768 non-null  object
 7   CONSO               1132768 non-null  object
 8   PDL                 1132768 non-null  int64
dtypes: int64(2), object(7)
memory usage: 86.4+ MB

In [48]:
gas_elec = [result_gas, result_elec]
gas_elec = pd.concat(gas_elec)
gas_elec.head()

,OPERATEUR,ANNEE,FILIERE,CODE_IRIS,ADRESSE,NOM_COMMUNE,CODE_GRAND_SECTEUR,CONSO,PDL
0,GRDF,2018,G,010040101,58 AVENUE PAUL PAINLEVE,AMBÉRIEU-EN-BUGEY,T,"4,641144e+02",1
1,GRDF,2018,G,010040101,54 AVENUE PAUL PAINLEVE,AMBÉRIEU-EN-BUGEY,R,"1,595118e+02",11
2,GRDF,2018,G,010040101,RTE CHATEAU GAILLARD,AMBÉRIEU-EN-BUGEY,T,"5,609286e+02",1
3,GRDF,2018,G,010040101,36 ALLEE DE LA BARBOTIERE,AMBÉRIEU-EN-BUGEY,T,"1,236034e+03",1
4,GRDF,2018,G,010040101,RUE MARIUS BERLIET,AMBÉRIEU-EN-BUGEY,T,"9,765200e+01",1

In [49]:
gas_elec.shape

(1610420, 9)

# Reading tables from the local DB

In [1]:
from data.get_data import get_data
import pandas as pd

In [2]:
#reading cities table 
all_data = get_data('all_data')
all_data.head(5)

successfully connected to postgres+psycopg2://sandrinevuachet:postgres@localhost:5432/final_project

,id,operators,year,energy,code_iris,address,city,code,consu,pdl
0,1,Enedis,2018,E,010040101,659 AVENUE LEON BLUM,AMBÉRIEU-EN-BUGEY,I,"852,40377",1
1,2,Enedis,2018,E,010040101,645 AVENUE LEON BLUM,AMBÉRIEU-EN-BUGEY,I,"61,78001",1
2,3,Enedis,2018,E,010040101,268 RUE DES MOUETTES,AMBÉRIEU-EN-BUGEY,I,"63,2543",1
3,4,Enedis,2018,E,010040101,72 AVENUE DE LA LIBERATION,AMBÉRIEU-EN-BUGEY,I,"929,53233",1
4,5,Enedis,2018,E,010040101,82 RUE DES MOUETTES,AMBÉRIEU-EN-BUGEY,R,"40,67797",22

In [3]:
#reading cities table 
cities = get_data('cities')
cities.head(5)

successfully connected to postgres+psycopg2://sandrinevuachet:postgres@localhost:5432/final_project

   id               name
0   1  AMBÉRIEU-EN-BUGEY
1   2           AMBRONAY
2   3          ANGLEFORT
3   4              ARANC
4   5             ARBENT

In [4]:
#reading energies table 
energies = get_data('energies')
energies.head(5)

successfully connected to postgres+psycopg2://sandrinevuachet:postgres@localhost:5432/final_project

   id name
0   1    E
1   2    G

In [5]:
#reading operators table 
operators = get_data('operators')
operators.head(5)

successfully connected to postgres+psycopg2://sandrinevuachet:postgres@localhost:5432/final_project

   id     name
0   1   Enedis
1   2      RTE
2   3     GRDF
3   4  GRT_GAZ
4   5   Teréga

In [6]:
#reading deliveries table 
deliveries = get_data('deliveries')
deliveries.head(5)

successfully connected to postgres+psycopg2://sandrinevuachet:postgres@localhost:5432/final_project

,id,year,iris_code,consumption,address,sector_id,operator_id,energy_id,city_id
0,1,2018,010040101,"1,073901e+02",82 RUE DES MOUETTES,2,3,2,1
1,2,2018,010040101,"1,151224e+02",84 RUE DES MOUETTES,2,3,2,1
2,3,2018,010040101,"1,236034e+03",36 ALLEE DE LA BARBOTIERE,3,3,2,1
3,4,2018,010040101,"1,487440e+03",AVENUE LEON BLUM,3,3,2,1
4,5,2018,010040101,"1,595118e+02",54 AVENUE PAUL PAINLEVE,2,3,2,1

In [7]:
test = deliveries.round({'consumption': 2})
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45299 entries, 0 to 45298
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           45299 non-null  int64
 1   year         45299 non-null  int64
 2   iris_code    45299 non-null  object
 3   consumption  45299 non-null  object
 4   address      45299 non-null  object
 5   sector_id    45299 non-null  int64
 6   operator_id  45299 non-null  int64
 7   energy_id    45299 non-null  int64
 8   city_id      45299 non-null  int64
dtypes: int64(6), object(3)
memory usage: 3.1+ MB

In [8]:
#reading sectors table 
sectors = get_data('sectors')
sectors.head(5)

successfully connected to postgres+psycopg2://sandrinevuachet:postgres@localhost:5432/final_project

   id name
0   1    I
1   2    R
2   3    T
3   4    A
4   5    X

In [9]:
#reading addresses table 
#addresses = get_data('addresses')
#addresses.head(5)

In [13]:
operators_ranking = deliveries[['operator_id','consumption']]
operators_ranking

       operator_id   consumption
0                3  1,073901e+02
1                3  1,151224e+02
2                3  1,236034e+03
3                3  1,487440e+03
4                3  1,595118e+02
...            ...           ...
45294            1  8,966909e+01
45295            1  9,101742e+01
45296            1  9,505636e+01
45297            1  9,530968e+01
45298            1  9,901728e+01

[45299 rows x 2 columns]

In [16]:
operators_ranking.describe()

        operator_id
count  45299.000000
mean       1.670147
std        0.945923
min        1.000000
25%        1.000000
50%        1.000000
75%        3.000000
max        5.000000

In [21]:
operators_ranking['consumption'] = int(operators_ranking['consumption'])
operators_ranking

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [ ]:
with engine.connect() as connection:
    result = connection.execute("""CREATE TABLE IF NOT EXISTS "associations"(
      "id" SERIAL PRIMARY KEY,
      "RNA" varchar,
      "name" varchar,
      "sigle" varchar,
      "description" varchar,
      "validation" varchar,
      "validation_date" date,
      "headquarter" varchar,
      "liste_activites" varchar,
      "contact_address" varchar,
      "zip_code" integer,
      "city" varchar,
      "website" varchar,
      "establishment" integer
    );""")